Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1180/periph/PERI_IERC_PCI.h
/*! @name PCI_CFC_PCIE_DEV_STAT - PCI PCIe device status register */
/*! @{ */

#define IERC_PCI_PCI_CFC_PCIE_DEV_STAT_TRANS_PEND_MASK (0x20U)
#define IERC_PCI_PCI_CFC_PCIE_DEV_STAT_TRANS_PEND_SHIFT (5U)
#define IERC_PCI_PCI_CFC_PCIE_DEV_STAT_TRANS_PEND(x) (((uint16_t)(((uint16_t)(x)) << IERC_PCI_PCI_CFC_PCIE_DEV_STAT_TRANS_PEND_SHIFT)) & IERC_PCI_PCI_CFC_PCIE_DEV_STAT_TRANS_PEND_MASK)
/*! @} */

/*! @name PCI_CFC_PCIE_ROOT_CTL - PCI PCIe root control register */
/*! @{ */

#define IERC_PCI_PCI_CFC_PCIE_ROOT_CTL_PME_INT_EN_MASK (0x8U)
#define IERC_PCI_PCI_CFC_PCIE_ROOT_CTL_PME_INT_EN_SHIFT (3U)
#define IERC_PCI_PCI_CFC_PCIE_ROOT_CTL_PME_INT_EN(x) (((uint16_t)(((uint16_t)(x)) << IERC_PCI_PCI_CFC_PCIE_ROOT_CTL_PME_INT_EN_SHIFT)) & IERC_PCI_PCI_CFC_PCIE_ROOT_CTL_PME_INT_EN_MASK)
/*! @} */

/*! @name PCI_CFC_PCIE_ROOT_STAT - PCI PCIe root status register */
/*! @{ */

#define IERC_PCI_PCI_CFC_PCIE_ROOT_STAT_PME_REQ_ID_MASK (0xFFFFU)
#define IERC_PCI_PCI_CFC_PCIE_ROOT_STAT_PME_REQ_ID_SHIFT (0U)
#define IERC_PCI_PCI_CFC_PCIE_ROOT_STAT_PME_REQ_ID(x) (((uint32_t)(((uint32_t)(x)) << IERC_PCI_PCI_CFC_PCIE_ROOT_STAT_PME_REQ_ID_SHIFT)) & IERC_PCI_PCI_CFC_PCIE_ROOT_STAT_PME_REQ_ID_MASK)

#define IERC_PCI_PCI_CFC_PCIE_ROOT_STAT_PME_STATUS_MASK (0x10000U)
#define IERC_PCI_PCI_CFC_PCIE_ROOT_STAT_PME_STATUS_SHIFT (16U)
#define IERC_PCI_PCI_CFC_PCIE_ROOT_STAT_PME_STATUS(x) (((uint32_t)(((uint32_t)(x)) << IERC_PCI_PCI_CFC_PCIE_ROOT_STAT_PME_STATUS_SHIFT)) & IERC_PCI_PCI_CFC_PCIE_ROOT_STAT_PME_STATUS_MASK)

#define IERC_PCI_PCI_CFC_PCIE_ROOT_STAT_PME_PEND_MASK (0x20000U)
#define IERC_PCI_PCI_CFC_PCIE_ROOT_STAT_PME_PEND_SHIFT (17U)
#define IERC_PCI_PCI_CFC_PCIE_ROOT_STAT_PME_PEND(x) (((uint32_t)(((uint32_t)(x)) << IERC_PCI_PCI_CFC_PCIE_ROOT_STAT_PME_PEND_SHIFT)) & IERC_PCI_PCI_CFC_PCIE_ROOT_STAT_PME_PEND_MASK)
/*! @} */

/*! @name PCI_CFC_PCIPM_CAP_LIST - PCI PCI-PM capabilities list register */
/*! @{ */

#define IERC_PCI_PCI_CFC_PCIPM_CAP_LIST_CAP_ID_MASK (0xFFU)
#define IERC_PCI_PCI_CFC_PCIPM_CAP_LIST_CAP_ID_SHIFT (0U)
#define IERC_PCI_PCI_CFC_PCIPM_CAP_LIST_CAP_ID(x) (((uint16_t)(((uint16_t)(x)) << IERC_PCI_PCI_CFC_PCIPM_CAP_LIST_CAP_ID_SHIFT)) & IERC_PCI_PCI_CFC_PCIPM_CAP_LIST_CAP_ID_MASK)

#define IERC_PCI_PCI_CFC_PCIPM_CAP_LIST_NEXT_CAP_ID_MASK (0xFF00U)
#define IERC_PCI_PCI_CFC_PCIPM_CAP_LIST_NEXT_CAP_ID_SHIFT (8U)
#define IERC_PCI_PCI_CFC_PCIPM_CAP_LIST_NEXT_CAP_ID(x) (((uint16_t)(((uint16_t)(x)) << IERC_PCI_PCI_CFC_PCIPM_CAP_LIST_NEXT_CAP_ID_SHIFT)) & IERC_PCI_PCI_CFC_PCIPM_CAP_LIST_NEXT_CAP_ID_MASK)
/*! @} */

/*! @name PCI_CFC_PCIPM_CAP - PCI PCI-PM capabilities register */
/*! @{ */

#define IERC_PCI_PCI_CFC_PCIPM_CAP_VERSION_MASK  (0x7U)
#define IERC_PCI_PCI_CFC_PCIPM_CAP_VERSION_SHIFT (0U)
#define IERC_PCI_PCI_CFC_PCIPM_CAP_VERSION(x)    (((uint16_t)(((uint16_t)(x)) << IERC_PCI_PCI_CFC_PCIPM_CAP_VERSION_SHIFT)) & IERC_PCI_PCI_CFC_PCIPM_CAP_VERSION_MASK)

#define IERC_PCI_PCI_CFC_PCIPM_CAP_PME_SUPPORT_MASK (0xF800U)
#define IERC_PCI_PCI_CFC_PCIPM_CAP_PME_SUPPORT_SHIFT (11U)
#define IERC_PCI_PCI_CFC_PCIPM_CAP_PME_SUPPORT(x) (((uint16_t)(((uint16_t)(x)) << IERC_PCI_PCI_CFC_PCIPM_CAP_PME_SUPPORT_SHIFT)) & IERC_PCI_PCI_CFC_PCIPM_CAP_PME_SUPPORT_MASK)
/*! @} */

/*! @name PCI_CFC_PCIPM_CTL_STAT - PCI PCI-PM control and status register */
/*! @{ */

#define IERC_PCI_PCI_CFC_PCIPM_CTL_STAT_PWR_STATE_MASK (0x3U)
#define IERC_PCI_PCI_CFC_PCIPM_CTL_STAT_PWR_STATE_SHIFT (0U)
#define IERC_PCI_PCI_CFC_PCIPM_CTL_STAT_PWR_STATE(x) (((uint16_t)(((uint16_t)(x)) << IERC_PCI_PCI_CFC_PCIPM_CTL_STAT_PWR_STATE_SHIFT)) & IERC_PCI_PCI_CFC_PCIPM_CTL_STAT_PWR_STATE_MASK)

#define IERC_PCI_PCI_CFC_PCIPM_CTL_STAT_NO_SOFT_RST_MASK (0x8U)
#define IERC_PCI_PCI_CFC_PCIPM_CTL_STAT_NO_SOFT_RST_SHIFT (3U)
#define IERC_PCI_PCI_CFC_PCIPM_CTL_STAT_NO_SOFT_RST(x) (((uint16_t)(((uint16_t)(x)) << IERC_PCI_PCI_CFC_PCIPM_CTL_STAT_NO_SOFT_RST_SHIFT)) & IERC_PCI_PCI_CFC_PCIPM_CTL_STAT_NO_SOFT_RST_MASK)
/*! @} */

/*! @name PCIE_CFC_AER_EXT_CAP_HDR - PCIe AER extended capability header */
/*! @{ */

#define IERC_PCI_PCIE_CFC_AER_EXT_CAP_HDR_PCIE_EXT_CAP_ID_MASK (0xFFFFU)
#define IERC_PCI_PCIE_CFC_AER_EXT_CAP_HDR_PCIE_EXT_CAP_ID_SHIFT (0U)
#define IERC_PCI_PCIE_CFC_AER_EXT_CAP_HDR_PCIE_EXT_CAP_ID(x) (((uint32_t)(((uint32_t)(x)) << IERC_PCI_PCIE_CFC_AER_EXT_CAP_HDR_PCIE_EXT_CAP_ID_SHIFT)) & IERC_PCI_PCIE_CFC_AER_EXT_CAP_HDR_PCIE_EXT_CAP_ID_MASK)

#define IERC_PCI_PCIE_CFC_AER_EXT_CAP_HDR_CAP_VER_MASK (0xF0000U)
#define IERC_PCI_PCIE_CFC_AER_EXT_CAP_HDR_CAP_VER_SHIFT (16U)
#define IERC_PCI_PCIE_CFC_AER_EXT_CAP_HDR_CAP_VER(x) (((uint32_t)(((uint32_t)(x)) << IERC_PCI_PCIE_CFC_AER_EXT_CAP_HDR_CAP_VER_SHIFT)) & IERC_PCI_PCIE_CFC_AER_EXT_CAP_HDR_CAP_VER_MASK)

#define IERC_PCI_PCIE_CFC_AER_EXT_CAP_HDR_NEXT_CAP_OFF_MASK (0xFFF00000U)
#define IERC_PCI_PCIE_CFC_AER_EXT_CAP_HDR_NEXT_CAP_OFF_SHIFT (20U)
#define IERC_PCI_PCIE_CFC_AER_EXT_CAP_HDR_NEXT_CAP_OFF(x) (((uint32_t)(((uint32_t)(x)) << IERC_PCI_PCIE_CFC_AER_EXT_CAP_HDR_NEXT_CAP_OFF_SHIFT)) & IERC_PCI_PCIE_CFC_AER_EXT_CAP_HDR_NEXT_CAP_OFF_MASK)
/*! @} */

/*! @name PCIE_CFC_AER_ROOT_ERR_CMD - PCIe AER root error command register */
/*! @{ */

#define IERC_PCI_PCIE_CFC_AER_ROOT_ERR_CMD_CORR_ERR_RPT_EN_MASK (0x1U)
#define IERC_PCI_PCIE_CFC_AER_ROOT_ERR_CMD_CORR_ERR_RPT_EN_SHIFT (0U)
#define IERC_PCI_PCIE_CFC_AER_ROOT_ERR_CMD_CORR_ERR_RPT_EN(x) (((uint32_t)(((uint32_t)(x)) << IERC_PCI_PCIE_CFC_AER_ROOT_ERR_CMD_CORR_ERR_RPT_EN_SHIFT)) & IERC_PCI_PCIE_CFC_AER_ROOT_ERR_CMD_CORR_ERR_RPT_EN_MASK)

#define IERC_PCI_PCIE_CFC_AER_ROOT_ERR_CMD_NON_FATAL_ERR_RPT_EN_MASK (0x2U)
#define IERC_PCI_PCIE_CFC_AER_ROOT_ERR_CMD_NON_FATAL_ERR_RPT_EN_SHIFT (1U)
#define IERC_PCI_PCIE_CFC_AER_ROOT_ERR_CMD_NON_FATAL_ERR_RPT_EN(x) (((uint32_t)(((uint32_t)(x)) << IERC_PCI_PCIE_CFC_AER_ROOT_ERR_CMD_NON_FATAL_ERR_RPT_EN_SHIFT)) & IERC_PCI_PCIE_CFC_AER_ROOT_ERR_CMD_NON_FATAL_ERR_RPT_EN_MASK)

#define IERC_PCI_PCIE_CFC_AER_ROOT_ERR_CMD_FATAL_ERR_RPT_EN_MASK (0x4U)
#define IERC_PCI_PCIE_CFC_AER_ROOT_ERR_CMD_FATAL_ERR_RPT_EN_SHIFT (2U)
#define IERC_PCI_PCIE_CFC_AER_ROOT_ERR_CMD_FATAL_ERR_RPT_EN(x) (((uint32_t)(((uint32_t)(x)) << IERC_PCI_PCIE_CFC_AER_ROOT_ERR_CMD_FATAL_ERR_RPT_EN_SHIFT)) & IERC_PCI_PCIE_CFC_AER_ROOT_ERR_CMD_FATAL_ERR_RPT_EN_MASK)
/*! @} */

/*! @name PCIE_CFC_AER_ROOT_ERR_STAT - PCIe AER root error status register */
/*! @{ */

#define IERC_PCI_PCIE_CFC_AER_ROOT_ERR_STAT_ERR_CORR_MASK (0x1U)
#define IERC_PCI_PCIE_CFC_AER_ROOT_ERR_STAT_ERR_CORR_SHIFT (0U)
#define IERC_PCI_PCIE_CFC_AER_ROOT_ERR_STAT_ERR_CORR(x) (((uint32_t)(((uint32_t)(x)) << IERC_PCI_PCIE_CFC_AER_ROOT_ERR_STAT_ERR_CORR_SHIFT)) & IERC_PCI_PCIE_CFC_AER_ROOT_ERR_STAT_ERR_CORR_MASK)

